otypes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-19 Tue 13:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title><code>moo</code> 無 <i>otypes</i></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="other/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="other/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title"><code>moo</code> 無 <i>otypes</i>
<br />
<span class="subtitle">Defining objects with <code>moo</code> <i>oschema</i> types</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc031bcb">Overview</a></li>
<li><a href="#org99c6bd0">Usage</a>
<ul>
<li><a href="#org53c3095">Individual type construction</a></li>
<li><a href="#orgc347324">Schema structure array</a></li>
<li><a href="#orgaa82906">Load types from file</a></li>
</ul>
</li>
<li><a href="#org2b00c82">Help</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc031bcb" class="outline-2">
<h2 id="orgc031bcb">Overview</h2>
<div class="outline-text-2" id="text-orgc031bcb">
<p>
<b>moo</b> <i>otypes</i> is way to produce instances of <i>oschema</i> types that tries to
follow a <i>valid-by-construction</i> pattern.  In general, <i>otypes</i> are native
language types (eg those of Python) which derive from <i>oschema</i> schema
data structures.  
</p>

<p>
For example, in the <a href="oschema.html">oschema</a> document we saw some basic use of the
general <i>otypes</i> pattern applied as C++ codegen in the <code>structs.hpp.j2</code>
and <code>nljs.hpp.j2</code> templates.  When instantiating a codegen'ed C++ <code>struct</code>
we have some immediate validity guarantees.  They may then
automatically transfer to a JSON object that may be derived from the
C++ <code>struct</code>.
</p>

<p>
The rest of this document describes how <b>moo</b> applies the <i>otypes</i> pattern
in Python.  With the use of the <code>moo.otypes</code> Python module, user code
may access Python classes corresponding to <i>oschema</i> types and in
instantiating them as Python objects gain some <i>valid-by-construction</i>
guarantees.
</p>

<div class="info" id="orge4d42aa">
<p>
See also <a href="https://brettviren.github.io/dune-daq-repl/ddcmd.html">DUNE DAQ Command Object Creation</a> which describes <code>moo.otypes</code>
in the context of one particular application.
</p>

</div>
</div>
</div>

<div id="outline-container-org99c6bd0" class="outline-2">
<h2 id="org99c6bd0">Usage</h2>
<div class="outline-text-2" id="text-org99c6bd0">
<p>
The <code>moo.otypes</code> module provides high level functions to construct types
from <i>oschema</i>.  They make use of lower-level Python metaprogramming for
the actual type construction which is also in this module.
</p>
</div>

<div id="outline-container-org53c3095" class="outline-3">
<h3 id="org53c3095">Individual type construction</h3>
<div class="outline-text-3" id="text-org53c3095">
<p>
We may make an individual type from <i>oschema</i> data structure which is
expressed as keyword arguments to the <code>moo.otypes.make_type()</code> function.
For example:
</p>

<div class="org-src-container">
<pre class="src src-python">import moo.otypes
Age = moo.otypes.make_type(
    name="Age", doc="An age in years",
    schema="number", dtype='i4', path='a.b')
myage = Age(42)  # my forever age
print(f'{Age}, {myage}, {myage.pod()}')
import a.b
myage2 = Age(18)
print(f'{a.b.Age}, {myage2}, {myage2.pod()}')

</pre>
</div>

<pre class="example">
&lt;class 'a.b.Age'&gt;, &lt;number Age: 42&gt;, 42
&lt;class 'a.b.Age'&gt;, &lt;number Age: 18&gt;, 18
</pre>


<div class="note" id="orgffbc150">
<p>
The <code>moo.otypes.make_type()</code> directly returns a Python type object (aka
Python class) and it "places" the type object into the module tree
given the schema structure's <code>.path</code> attribute.  
</p>

</div>

<p>
We may try to use our otype with invalid data:
</p>

<pre class="example" id="org941d5c2">
myage = Age("older than the hills")
</pre>

<p>
Which will return an error like:
</p>

<pre class="example" id="orgfc1a6d2">
Traceback (most recent call last):
  File "&lt;stdin&gt;", line 8, in &lt;module&gt;
  File "&lt;number Age&gt;", line 13, in __init__
  File "/home/bv/dev/moo/moo/otypes.py", line 485, in update
    self._value = numpy.array(val, dtype)
ValueError: invalid literal for int() with base 10: 'older than the hills'
</pre>

<p>
This error illustrates how the <i>valid-by-construction</i> pattern works.
It's not that magic is performed and the data is miraculously valid.
Rather, we the developer are immediately punished if we attempt to
violate the schema.  
</p>

<div class="note" id="org4f2fbda">
<p>
We may also produce an object from these (or more generic) types and
validate that object against schema.  It is important to know that the
constraints asserted by these two validation procedures are somewhat
disjoint.  As <code>moo.otypes</code> matures it may gain more rigor, but for now
the JSON Schema based validation on a final object will catch mistakes
that <code>moo.otypes</code> will miss during object construction.
</p>

</div>
</div>
</div>


<div id="outline-container-orgc347324" class="outline-3">
<h3 id="orgc347324">Schema structure array</h3>
<div class="outline-text-3" id="text-orgc347324">
<p>
Creation of a <i>system of related types</i> is done with an array of data
structures describing its schema and the Python types are constructed
with the plural function <code>moo.otypes.make_types()</code>.  For example:
</p>

<div class="org-src-container">
<pre class="src src-python">import moo.otypes
schema = [dict(name="Pet", schema="enum",
               symbols=["cat", "dog", "early personal computer"],
               default="cat",
               path="my.home.office",
               doc="A kind of pet"),
          dict(name="Desk", schema="record",
               fields=[
                   dict(name="ontop", item="my.home.office.Pet"),
               ],
               path="my.home.office",
               doc="Model my desk")]
moo.otypes.make_types(schema)

from my.home.office import Desk, Pet
desk = Desk(ontop="cat")
print(f'{Desk}, {desk}, {desk.pod()}, {desk.ontop}')
</pre>
</div>

<pre class="example">
&lt;class 'my.home.office.Desk'&gt;, &lt;record Desk, fields: {ontop}&gt;, {'ontop': 'cat'}, cat
</pre>


<div class="note" id="orgd33ab89">
<p>
The schema structure array is assumed to be sorted in topological
order of type dependencies.  Here, this is implicitly assured by how
the <code>schema</code> array is formed.  In more complex code one may rely on
<code>moo.oschema.toposort()</code> to produce a sorted schema array.
</p>

</div>
</div>
</div>

<div id="outline-container-orgaa82906" class="outline-3">
<h3 id="orgaa82906">Load types from file</h3>
<div class="outline-text-3" id="text-orgaa82906">
<p>
The highest layer function is <code>moo.otypes.load_types()</code>.  It is a mere
convenience function that combines the <b>moo</b> method to load a schema
file and a call to <code>make_types()</code> on the result.  
</p>

<div class="note" id="org0cdd41d">
<p>
Any file format that <b>moo</b> supports may be used to provide schema, while
Jsonnet is recommended.  See the <a href="oschema.html">oschema</a> document for more details on
how to construct schema files.
</p>

</div>

<p>
We can see <code>load_types()</code> in action using a schema that is part of the
<b>moo</b> test suite:
</p>

<div class="org-src-container">
<pre class="src src-python">import os
import moo.otypes

# Directly make a type in Python to use for an "any" below
moo.otypes.make_type(schema="string", name="Uni", path="test.basetypes")
from test.basetypes import Uni

# We locate and load a test schema file
here = os.path.join(os.path.dirname(__file__), "test")
types = moo.otypes.load_types("test-ogen-oschema.jsonnet", [here])

from app import Person
per = Person(email="foo@example.com", counts=[42],
             affil=Uni("Snooty U"), mbti="judging")
print(f'{Person}, {per}, {per.affil}')
print(per.pod())
</pre>
</div>

<pre class="example">
&lt;class 'app.Person'&gt;, &lt;record Person, fields: {email, counts, affil, mbti}&gt;, Snooty U
{'email': 'foo@example.com', 'counts': [42], 'affil': 'Snooty U', 'mbti': 'judging'}
</pre>



<div class="note" id="orgcaefb5e">
<p>
In the above we give <code>load_types()</code> a file system path (ie, <code>[here]</code>) so
that in the <b>moo</b> test suite directory will be located.  <b>moo</b> will search
this path when a file is given as a relative path.
</p>

<p>
When using <code>moo</code> Python module the application may set a default path
instead of providing one to every <code>moo.io.load()</code> call (which
<code>load_types()</code> forwards to).  An example of this usage is given below.
</p>

<p>
When using the <code>moo</code> CLI one may set the environment variable
<code>MOO_LOAD_PATH</code> to equivalently provide this default load path.
</p>

</div>
</div>
</div>
</div>


<div id="outline-container-org2b00c82" class="outline-2">
<h2 id="org2b00c82">Help</h2>
<div class="outline-text-2" id="text-org2b00c82">
<p>
Type information and any <code>doc</code> strings given in the schema are reflected
into the constructed Python types.  This information can be displayed
using usual Python meta interrogation methods.  For example:
</p>

<div class="org-src-container">
<pre class="src src-python">import os
import moo.otypes
import moo.io

here = os.path.join(os.path.dirname(__file__), "test")
moo.io.default_load_path = [here]
types = moo.otypes.load_types("test-ogen-oschema.jsonnet")

from app import Person

help(Person)
</pre>
</div>

<pre class="example" id="orgc3faa42">
Help on class Person in module app:

class Person(moo.otypes.Record)
 |  Person(*args, email: app.Email = None, counts: app.Counts = None, affil: app.Affiliation = None, mbti: app.MBTI = 'introversion')
 |  
 |  Record type Person with fields: "email", "counts", "affil", "mbti"
 |  
 |  Describe everything there is to know about an individual human
 |  
 |  Method resolution order:
 |      Person
 |      moo.otypes.Record
 |      moo.otypes.BaseType
 |      abc.ABC
 |      builtins.object
 |  
 |  Methods defined here:
 |  
 |  __init__(self, *args, email: app.Email = None, counts: app.Counts = None, affil: app.Affiliation = None, mbti: app.MBTI = 'introversion')
 |      Create a record type of Person
 |  
 |  ----------------------------------------------------------------------
 |  Data descriptors defined here:
 |  
 |  affil
 |  
 |  counts
 |  
 |  email
 |  
 |  mbti
 |  
 |  ----------------------------------------------------------------------
 |  Data and other attributes defined here:
 |  
 |  __abstractmethods__ = frozenset()
 |  
 |  ----------------------------------------------------------------------
 |  Methods inherited from moo.otypes.Record:
 |  
 |  __repr__(self)
 |      Return repr(self).
 |  
 |  pod(self)
 |      Return record as plain old data.
 |      
 |      Will perform validation.
 |  
 |  update(self, *args, **kwds)
 |      Update a record.
 |      
 |      An arg in args may be one of:
 |      - a JSON string
 |      - a dictionary
 |      - an instance of a record of same type.
 |      
 |      kwds may be a dictionary.
 |      
 |      Dictionaries are taken to be field settings, values can be POD
 |      or a typed object consistent with the field type.
 |  
 |  ----------------------------------------------------------------------
 |  Readonly properties inherited from moo.otypes.Record:
 |  
 |  field_names
 |      Return list of field names
 |  
 |  fields
 |      Return mapping of field name to field dict
 |  
 |  ----------------------------------------------------------------------
 |  Readonly properties inherited from moo.otypes.BaseType:
 |  
 |  ost
 |      The object schema type
 |  
 |  ----------------------------------------------------------------------
 |  Data descriptors inherited from moo.otypes.BaseType:
 |  
 |  __dict__
 |      dictionary for instance variables (if defined)
 |  
 |  __weakref__
 |      list of weak references to the object (if defined)

</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brett Viren</p>
<p class="date">Created: 2021-01-19 Tue 13:01</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
